Pipe Heat Transfer/Linux Files/cases/turb_Re20000/0/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 114.99778169998916;
boundaryField
{
    inlet   { type fixedValue; value uniform 114.99778169998916; }
    outlet  { type zeroGradient; }
    wall    { type omegaWallFunction; value uniform 114.99778169998916; }
    front   { type wedge; }
    back    { type wedge; }
    axis    { type empty; }
}
