Pipe Heat Transfer/Linux Files/cases/turb_Re20000/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     buoyantSimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          1;

writeControl    timeStep;
writeInterval   500;
purgeWrite      1;

writeFormat     ascii;
writePrecision  8;
runTimeModifiable true;

functions
{
    wallHeatFlux
    {
        type            wallHeatFlux;
        libs            ("libfieldFunctionObjects.so");
        patches         (wall);
        writeControl    writeTime;
        log             true;
    }
}
